{
  "id": "georgia-war-2008",
  "title": "Russo-Georgian War (2008)",
  "date": "2008-08-08",
  "category": "event",
  "summary": "Five-day war between Russia and Georgia over the breakaway regions of South Ossetia and Abkhazia. Russia invaded Georgia, defeated Georgian forces, and recognized South Ossetia and Abkhazia as independent states. Seen as precursor to Crimea and Ukraine.",

  "russian_perspective": {
    "official_narrative": "Georgia attacked South Ossetia, committing genocide against Ossetians and killing Russian peacekeepers. Russia conducted a humanitarian intervention to protect civilians and restore peace. Georgia was armed and encouraged by the West (NATO) to attack.",
    "media_framing": {
      "core_claims": [
        "Georgia initiated the war by attacking Tskhinvali (South Ossetia capital)",
        "Georgian forces committed genocide and ethnic cleansing",
        "Russia was protecting Russian peacekeepers legally stationed there",
        "West (US/NATO) encouraged Georgian aggression",
        "South Ossetia and Abkhazia have right to self-determination"
      ]
    },
    "key_quotes": [
      {
        "speaker": "Dmitry Medvedev",
        "date": "2008-08-26",
        "quote": "We don't have any other choice but to recognize the independence of South Ossetia and Abkhazia.",
        "context": "Announcement of recognition"
      },
      {
        "speaker": "Vladimir Putin",
        "date": "2008-08-08",
        "quote": "War has started. The Georgian troops have been already eliminated from South Ossetia's territory.",
        "context": "During Beijing Olympics"
      }
    ]
  },

  "western_perspective": {
    "official_narrative": "Russia provoked Georgia into military action, then used it as pretext for disproportionate invasion. Russia's recognition of breakaway regions violated Georgia's territorial integrity and international law.",
    "counter_arguments": [
      "Russian provocations preceded Georgian action",
      "Russian response was disproportionate",
      "Russia advanced into undisputed Georgian territory (Gori)",
      "Recognition of breakaway regions violated international norms",
      "Precedent for future Russian aggression"
    ]
  },

  "facts": {
    "verified_claims": [
      "Fighting began August 7-8, 2008 (during Beijing Olympics)",
      "Georgia launched artillery attack on Tskhinvali on Aug 7",
      "Russia invaded Georgia proper (beyond South Ossetia) on Aug 9-10",
      "Ceasefire brokered by France (Sarkozy) on August 12",
      "Russia recognized South Ossetia and Abkhazia independence on Aug 26",
      "Only Nicaragua, Venezuela, Nauru, Syria recognize the territories",
      "EU investigation: Both sides violated international law"
    ],
    "disputed_claims": [
      "Who started the war (provocations preceded Georgian attack)",
      "Genocide claims (no evidence of genocide)",
      "Casualty figures (both sides inflated numbers)"
    ],
    "data_points": {
      "duration": "5 days (Aug 7-12, 2008)",
      "casualties_estimated": "~700-1,000 total (civilians + military)",
      "displaced_persons": "~190,000",
      "countries_recognizing_independence": "4 (Russia, Nicaragua, Venezuela, Nauru)"
    }
  },

  "propaganda_techniques_observed": [
    "Genocide claims (without evidence)",
    "Protection narrative (saving Ossetians)",
    "Provocation (accusing Georgia of starting war)",
    "Fait accompli (rapid military victory, then recognition)"
  ],

  "related_entries": [
    "crimea-annexation-2014",
    "2022-ukraine-invasion",
    "putin-worldview"
  ],

  "sources": [
    {
      "type": "investigation",
      "description": "EU Independent Fact-Finding Mission Report",
      "url": "https://www.echr.coe.int/"
    }
  ]
}
